{
    "profile": [
        [
            "What is a network",
            "A network consists of two or more computers that are linked in order to share resources (such as printers and CDs), exchange files, or allow electronic communications."
        ],
        [
            " What is a Link",
            "A link refers to the connectivity between two devices. It includes the type of cables and protocols used in order for one device to be able to communicate with the other."
        ],
        [
            "What are the layers of the OSI reference model",
            "There are 7 OSI layers: Physical Layer, Data Link Layer, Network Layer, Transport Layer, Session Layer, Presentation Layer and Application Layer."
        ],
        [
            " What is backbone network",
            "A backbone network is a centralized infrastructure that is designed to distribute different routes and data to various networks. It also handles management of bandwidth and various channels."
        ],
        [
            " What is a LAN",
            "LAN is short for Local Area Network. It refers to the connection between computers and other network devices that are located within a small physical location."
        ],
        [
            " What is a node",
            "A node refers to a point or joint where a connection takes place. It can be computer or device that is part of a network. Two or more nodes are needed in order to form a network connection."
        ],
        [
            " What are routers",
            "Routers can connect two or more network segments. These are intelligent network devices that store information in its routing table such as paths, hops and bottlenecks. With this info, they are able to determine the best path for data transfer. Routers operate at the OSI Network Layer."
        ],
        [
            "What is point to point link",
            "It refers to a direct connection between two computers on a network. A point to point connection does not need any other network devices other than connecting a cable to the NIC cards of both computers."
        ],
        [
            "What is anonymous FTP",
            "Anonymous FTP is a way of granting user access to files in public servers. Users that are allowed access to data in these servers do not need to identify themselves, but instead log in as an anonymous guest."
        ],
        [
            "What is subnet mask",
            "A subnet mask is combined with an IP address in order to identify two parts: the extended network address and the host address. Like an IP address, a subnet mask is made up of 32 bits."
        ],
        [
            "What is the maximum length allowed for a UTP cable",
            "A single segment of UTP cable has an allowable length of 90 to 100 meters. This limitation can be overcome by using repeaters and switches."
        ],
        [
            "What is data encapsulation",
            "Data encapsulation is the process of breaking down information into smaller manageable chunks before it is transmitted across the network. It is also in this process that the source and destination addresses are attached into the headers, along with parity checks."
        ],
        [
            "Describe Network Topology",
            "Network Topology refers to the layout of a computer network. It shows how devices and cables are physically laid out, as well as how they connect to one another."
        ],
        [
            "What is VPN",
            "VPN means Virtual Private Network, a technology that allows a secure tunnel to be created across a network such as the Internet. For example, VPNs allow you to establish a secure dial-up connection to a remote server."
        ],
        [
            "Briefly describe NAT.",
            "NAT is Network Address Translation. This is a protocol that provides a way for multiple computers on a common network to share single connection to the Internet."
        ],
        [
            "What is the job of the Network Layer under the OSI reference model",
            "The Network layer is responsible for data routing, packet switching and control of network congestion. Routers operate under this layer."
        ],
        [
            " How does a network topology affect your decision in setting up a network",
            "Network topology dictates what media you must use to interconnect devices. It also serves as basis on what materials, connector and terminations that is applicable for the setup."
        ],
        [
            " What is RIP",
            "RIP, short for Routing Information Protocol is used by routers to send data from one network to another. It efficiently manages routing data by broadcasting its routing table to all other routers within the network. It determines the network distance in units of hops."
        ],
        [
            "What are different ways of securing a computer network",
            "There are several ways to do this. Install reliable and updated anti-virus program on all computers. Make sure firewalls are setup and configured properly. User authentication will also help a lot. All of these combined would make a highly secured network."
        ],
        [
            " What is NIC",
            "NIC is short for Network Interface Card. This is a peripheral card that is attached to a PC in order to connect to a network. Every NIC has its own MAC address that identifies the PC on the network."
        ],
        [
            "What is WAN",
            "WAN stands for Wide Area Network. It is an interconnection of computers and devices that are geographically dispersed. It connects networks that are located in different regions and countries."
        ],
        [
            "What is the importance of the OSI Physical Layer",
            "The physical layer does the conversion from data bits to electrical signal, and vice versa. This is where network devices and cable types are considered and setup."
        ],
        [
            "How many layers are there under TCP/IP",
            "There are four layers: the Network Layer, Internet Layer, Transport Layer and Application Layer."
        ],
        [
            " What are proxy servers and how do they protect computer networks",
            "Proxy servers primarily prevent external users who identifying the IP addresses of an internal network. Without knowledge of the correct IP address, even the physical location of the network cannot be identified. Proxy servers can make a network virtually invisible to external users."
        ],
        [
            " What is the function of the OSI Session Layer",
            "This layer provides the protocols and means for two devices on the network to communicate with each other by holding a session.  This includes setting up the session, managing information exchange during the session, and tear-down process upon termination of the session."
        ],
        [
            " What is the importance of implementing a Fault Tolerance System? Are there limitations",
            "A fault tolerance system ensures continuous data availability. This is done by eliminating a single point of failure. However, this type of system would not be able to protect data in some cases, such as in accidental deletions."
        ],
        [
            " What does 10Base-T mean",
            "The 10 refers to the data transfer rate, in this case is 10Mbps. The word Base refers to base band, as oppose to broad band. T means twisted pair, which is the cable used for that network."
        ],
        [
            "What is a private IP address",
            "Private IP addresses are assigned for use on intranets. These addresses are used for internal networks and are not routable on external public networks. These ensures that no conflicts are present among internal networks while at the same time the same range of private IP addresses are reusable for multiple intranets since they do not “see” each other."
        ],
        [
            " What is NOS",
            "NOS, or Network Operating System, is specialized software whose main task is to provide network connectivity to a computer in order for it to be able to communicate with other computers and connected devices."
        ],
        [
            " What is DoS",
            "DoS, or Denial-of-Service attack, is an attempt to prevent users from being able to access the internet or any other network services. Such attacks may come in different forms and are done by a group of perpetuators. One common method of doing this is to overload the system server so it cannot anymore process legitimate traffic and will be forced to reset."
        ],
        [
            " What is OSI and what role does it play in computer networks",
            "OSI (Open Systems Interconnect) serves as a reference model for data communication. It is made up of 7 layers, with each layer defining a particular aspect on how network devices connect and communicate with one another. One layer may deal with the physical media used, while another layer dictates how data is actually transmitted across the network."
        ],
        [
            "What is the purpose of cables being shielded and having twisted pairs",
            "The main purpose of this is to prevent crosstalk. Crosstalks are electromagnetic interferences or noise that can affect data being transmitted across cables."
        ],
        [
            "What is the advantage of address sharing",
            "By using address translation instead of routing, address sharing provides an inherent security benefit. That’s because host PCs on the Internet can only see the public IP address of the external interface on the computer that provides address translation and not the private IP addresses on the internal network."
        ],
        [
            "What are MAC addresses",
            "MAC, or Media Access Control, uniquely identifies a device on the network. It is also known as physical address or Ethernet address. A MAC address is made up of 6-byte parts."
        ],
        [
            "What is the equivalent layer or layers of the TCP/IP Application layer in terms of OSI reference model",
            "The TCP/IP Application layer actually has three counterparts on the OSI model: the Session layer, Presentation Layer and Application Layer."
        ],
        [
            "How can you identify the IP class of a given IP address",
            "By looking at the first octet of any given IP address, you can identify whether it’s Class A, B or C. If the first octet begins with a 0 bit, that address is Class A. If it begins with bits 10 then that address is a Class B address. If it begins with 110, then it’s a Class C network."
        ],
        [
            "What is the main purpose of OSPF",
            "OSPF, or Open Shortest Path First, is a link-state routing protocol that uses routing tables to determine the best possible path for data exchange."
        ],
        [
            " What are firewalls",
            "Firewalls serve to protect an internal network from external attacks. These external threats can be hackers who want to steal data or computer viruses that can wipe out data in an instant. It also prevents other users from external networks from gaining access to the private network."
        ],
        [
            " Describe star topology",
            "Star topology consists of a central hub that connects to nodes. This is one of the easiest to setup and maintain."
        ],
        [
            "What are gateways",
            "Gateways provide connectivity between two or more network segments. It is usually a computer that runs the gateway software and provides translation services. This translation is a key in allowing different systems to communicate on the network."
        ],
        [
            " What is the disadvantage of a star topology",
            "One major disadvantage of star topology is that once the central hub or switch get damaged, the entire network becomes unusable."
        ],
        [
            "What is SLIP",
            "SLIP, or Serial Line Interface Protocol, is actually an old protocol developed during the early UNIX days. This is one of the protocols that are used for remote access."
        ],
        [
            "Give some examples of private network addresses.",
            "10.0.0.0 with a subnet mask of 255.0.0.0"
        ],
        [
            " What is tracert",
            "Tracert is a Windows utility program that can used to trace the route taken by data from the router to the destination network. It also shows the number of hops taken during the entire transmission route."
        ],
        [
            "What are the functions of a network administrator",
            "A network administrator has many responsibilities that can be summarize into 3 key functions: installation of a network, configuration of network settings, and maintenance/troubleshooting of networks."
        ],
        [
            "Describe at one disadvantage of a peer to peer network.",
            "When you are accessing the resources that are shared by one of the workstations on the network, that workstation takes a performance hit."
        ],
        [
            "What is Hybrid Network",
            "A hybrid network is a network setup that makes use of both client-server and peer-to-peer architecture."
        ],
        [
            "What is DHCP",
            "DHCP is short for Dynamic Host Configuration Protocol. Its main task is to automatically assign an IP address to devices across the network. It first checks for the next available address not yet taken by any device, then assigns this to a network device."
        ],
        [
            "What is the main job of the ARP",
            "The main task of ARP or Address Resolution Protocol is to map a known IP address to a MAC layer address."
        ],
        [
            "What is TCP/IP",
            "TCP/IP is short for Transmission Control Protocol / Internet Protocol. This is a set of protocol layers that is designed to make data exchange possible on different types of computer networks, also known as heterogeneous network."
        ],
        [
            "How can you manage a network using a router",
            "Routers have built in console that lets you configure different settings, like security and data logging. You can assign restrictions to computers, such as what resources it is allowed access, or what particular time of the day they can browse the internet. You can even put restrictions on what websites are not viewable across the entire network."
        ],
        [
            " What protocol can be applied when you want to transfer files between different platforms, such between UNIX systems and Windows servers",
            "Use FTP (File Transfer Protocol) for file transfers between such different servers. This is possible because FTP is platform independent."
        ],
        [
            "What is the use of a default gateway",
            "Default gateways provide means for the local networks to connect to the external network. The default gateway for connecting to the external network is usually the address of the external router port."
        ],
        [
            " One way of securing a network is through the use of passwords. What can be considered as good passwords",
            "Good passwords are made up of not just letters, but by combining letters and numbers. A password that combines uppercase and lowercase letters is favorable than one that uses all upper case or all lower case letters. Passwords must be not words that can easily be guessed by hackers, such as dates, names, favorites, etc. Longer passwords are also better than short ones."
        ],
        [
            "What is the proper termination rate for UTP cables",
            "The proper termination for unshielded twisted pair network cable is 100 ohms."
        ],
        [
            "What is netstat",
            "Netstat is a command line utility program. It provides useful information about the current TCP/IP settings of a connection."
        ],
        [
            " What is the number of network IDs in a Class C network",
            "For a Class C network, the number of usable Network ID bits is 21. The number of possible network IDs is 2 raised to 21 or 2,097,152. The number of host IDs per network ID is 2 raised to 8 minus 2, or 254."
        ],
        [
            " What happens when you use cables longer than the prescribed length",
            "Cables that are too long would result in signal loss. This means that data transmission and reception would be affected, because the signal degrades over length."
        ],
        [
            "What common software problems can lead to network defects",
            "Software related problems can be any or a combination of the following– client server problems– application conflicts– error in configuration– protocol mismatch– security issues– user policy and rights issues"
        ],
        [
            "What is ICMP",
            "ICMP is Internet Control Message Protocol. It provides messaging and communication for protocols within the TCP/IP stack. This is also the protocol that manages error messages that are used by network tools such as PING."
        ],
        [
            "What is Ping",
            "Ping is a utility program that allows you to check connectivity between network devices on the network. You can ping a device by using its IP address or device name, such as a computer name."
        ],
        [
            "What is peer to peer",
            "Peer to peer are networks that does not reply on a server. All PCs on this network act as individual workstations."
        ],
        [
            "What is DNS",
            "DNS is Domain Name System. The main function of this network service is to provide host names to TCP/IP address resolution."
        ],
        [
            " What advantages does fiber optics have over other media",
            "One major advantage of fiber optics is that is it less susceptible to electrical interference. It also supports higher bandwidth, meaning more data can be transmitted and received. Signal degrading is also very minimal over long distances."
        ],
        [
            " What is the difference between a hub and a switch",
            "A hub acts as a multiport repeater. However, as more and more devices connect to it, it would not be able to efficiently manage the volume of traffic that passes through it. A switch provides a better alternative that can improve the performance especially when high traffic volume is expected across all ports."
        ],
        [
            " What are the different network protocols that are supported by Windows RRAS services",
            "There are three main network protocols supported: NetBEUI, TCP/IP, and IPX."
        ],
        [
            "What are the maximum networks and hosts in a class A, B and C network",
            "For Class A, there are 126 possible networks and 16,777,214 hosts -For Class B, there are 16,384 possible networks and 65,534 hosts-For Class C, there are 2,097,152 possible networks and 254 hosts"
        ],
        [
            "What is the standard color sequence of a straight-through cable",
            "orange/white, orange, green/white, blue, blue/white, green, brown/white, brown."
        ],
        [
            "What protocols fall under the Application layer of the TCP/IP stack",
            "The following are the protocols under TCP/IP Application layer: FTP, TFTP, Telnet and SMTP."
        ],
        [
            " You need to connect two computers for file sharing. Is it possible to do this without using a hub or router",
            "Yes, you can connect two computers together using only one cable. A crossover type cable can be use in this scenario. In this setup, the data transmit pin of one cable is connected to the data receive pin of the other cable, and vice versa."
        ],
        [
            "What is ipconfig",
            "Ipconfig is a utility program that is commonly used to identify the addresses information of a computer on a network. It can show the physical address as well as the IP address."
        ],
        [
            "What is the difference between a straight-through and crossover cable",
            "A straight-through cable is used to connect computers to a switch, hub or router. A crossover cable is used to connect two similar devices together, such as a PC to PC or Hub to hub."
        ],
        [
            "What is client/server",
            "Client/server is a type of network wherein one or more computers act as servers. Servers provide a centralized repository of resources such as printers and files. Clients refers to workstation that access the server."
        ],
        [
            " Describe networking.",
            "Networking refers to the inter connection between computers and peripherals for data communication. Networking can be done using wired cabling or through wireless link."
        ],
        [
            "When you move the NIC cards from one PC to another PC, does the MAC address gets transferred as well",
            "Yes, that’s because MAC addresses are hard-wired into the NIC circuitry, not the PC. This also means that a PC can have a different MAC address when the NIC card was replace by another one."
        ],
        [
            "Explain clustering support",
            "Clustering support refers to the ability of a network operating system to connect multiple servers in a fault-tolerant group. The main purpose of this is the in the event that one server fails, all processing will continue on with the next server in the cluster."
        ],
        [
            "In a network that contains two servers and twenty workstations, where is the best place to install an Anti-virus program",
            "An anti-virus program must be installed on all servers and workstations to ensure protection. That’s because individual users can access any workstation and introduce a computer virus when plugging in their removable hard drives or flash drives."
        ],
        [
            "Describe Ethernet",
            "Ethernet is one of the popular networking technologies used these days. It was developed during the early 1970s and is based on specifications as stated in the IEEE. Ethernet is used in local area networks."
        ],
        [
            "What are some drawbacks of implementing a ring topology",
            "In case one workstation on the network suffers a malfunction, it can bring down the entire network. Another drawback is that when there are adjustments and reconfigurations needed to be performed on a particular part of the network, the entire network has to be temporarily brought down as well."
        ],
        [
            "What is the difference between CSMA/CD and CSMA/CA",
            "CSMA/CD, or Collision Detect, retransmits data frames whenever a collision occurred. CSMA/CA, or Collision Avoidance, will first broadcast intent to send prior to data transmission."
        ],
        [
            "What is SMTP",
            "SMTP is short for Simple Mail Transfer Protocol. This protocol deals with all Internal mail, and provides the necessary mail delivery services on the TCP/IP protocol stack."
        ],
        [
            "What is multicast routing",
            "Multicast routing is a targeted form of broadcasting that sends message to a selected group of user, instead of sending it to all users on a subnet."
        ],
        [
            "What is the importance of Encryption on a network",
            "Encryption is the process of translating information into a code that is unreadable by the user. It is then translated back or decrypted back to its normal readable format using a secret key or password. Encryption help ensure that information that is intercepted halfway would remain unreadable because the user has to have the correct password or key for it."
        ],
        [
            "How are IP addresses arranged and displayed",
            "IP addresses are displayed as a series of four decimal numbers that are separated by period or dots. Another term for this arrangement is the dotted decimal format. An example is 192.168.101.2"
        ],
        [
            "Explain the importance of authentication.",
            "Authentication is the process of verifying a user’s credentials before he can log into the network. It is normally performed using a username and password. This provides a secure means of limiting the access from unwanted intruders on the network."
        ],
        [
            " What do mean by tunnel mode",
            "This is a mode of data exchange wherein two communicating computers do not use IPSec themselves. Instead, the gateway that is connecting their LANs to the transit network creates a virtual tunnel that uses the IPSec protocol to secure all communication that passes through it."
        ],
        [
            "What are the different technologies involved in establishing WAN links",
            "Analog connections – using conventional telephone lines; Digital connections – using digital-grade telephone lines; switched connections – using multiple sets of links between sender and receiver to move data."
        ],
        [
            "What is one advantage of mesh topology",
            "In the event that one link fails, there will always be another available. Mesh topology is actually one of the most fault-tolerant network topology."
        ],
        [
            "When troubleshooting computer network problems, what common hardware-related problems can occur",
            "A large percentage of a network is made up of hardware. Problems in these areas can range from malfunctioning hard drives, broken NICs and even hardware startups. Incorrectly hardware configuration is also one of those culprits to look into."
        ],
        [
            "What can be done to fix signal attenuation problems",
            "A common way of dealing with such a problem is to use repeaters and hub, because it will help regenerate the signal and therefore prevent signal loss. Checking if cables are properly terminated is also a must."
        ],
        [
            "How does dynamic host configuration protocol aid in network administration",
            "Instead of having to visit each client computer to configure a static IP address, the network administrator can apply dynamic host configuration protocol to create a pool of IP addresses known as scopes that can be dynamically assigned to clients."
        ],
        [
            "Explain profile in terms of networking concept",
            "Profiles are the configuration settings made for each user. A profile may be created that puts a user in a group, for example."
        ],
        [
            "What is sneakernet",
            "Sneakernet is believed to be the earliest form of networking wherein data is physically transported using removable media, such as disk, tapes."
        ],
        [
            "What is the role of IEEE in computer networking",
            "IEEE, or the Institute of Electrical and Electronics Engineers, is an organization composed of engineers that issues and manages standards for electrical and electronic devices. This includes networking devices, network interfaces, cablings and connectors."
        ],
        [
            "What protocols fall under the TCP/IP Internet Layer",
            "There are 4 protocols that are being managed by this layer. These are ICMP, IGMP, IP and ARP."
        ],
        [
            "When it comes to networking, what are rights",
            "Rights refer to the authorized permission to perform specific actions on the network. Each user on the network can be assigned individual rights, depending on what must be allowed for that user."
        ],
        [
            "What is one basic requirement for establishing VLANs",
            "A VLAN is required because at switch level there is only one broadcast domain, it means whenever new user is connected to switch this information is spread throughout the network. VLAN on switch helps to create separate broadcast domain at  switch level. It is used for security purpose."
        ],
        [
            "What is IPv6",
            "IPv6 , or Internet Protocol version 6, was developed to replace IPv4. At present, IPv4 is being used to control internet traffic, butis expected to get saturated in the near future. IPv6 was designed to overcome this limitation."
        ],
        [
            " What is RSA algorithm",
            "RSA is short for Rivest-Shamir-Adleman algorithm. It is the most commonly used public key encryption algorithm in use today."
        ],
        [
            "What is mesh topology",
            "Mesh topology is a setup wherein each device is connected directly to every other device on the network. Consequently, it requires that each device have at least two network connections."
        ],
        [
            "what is the maximum segment length of a 100Base-FX network",
            "The maximum allowable length for a network segment using 100Base-FX is 412 meters. The maximum length for the entire network is 5 kilometers."
        ],
         
    ]
}
